app/controllers/events_controller.rb

SELECT events.*, (69.09332411348201 * ABS(events.latitude - 30.3438812) * 0.7071067811865475) + (59.836573914187355 * ABS(events.longitude - -89.82333249999999) * 0.7071067811865475) AS distance, CASE WHEN (latitude >= 30.3438812 AND longitude >= -89.82333249999999) THEN 45.0 WHEN (latitude < 30.3438812 AND longitude >= -89.82333249999999) THEN 135.0 WHEN (latitude < 30.3438812 AND longitude < -89.82333249999999) THEN 225.0 WHEN (latitude >= 30.3438812 AND longitude < -89.82333249999999) THEN 315.0 END AS bearing FROM "events" WHERE (latitude BETWEEN 29.62022228444576 AND 31.067540115554237 AND longitude BETWEEN -90.66186257827307 AND -88.98480242172691) ORDER BY distance
---
  def index
  if params[:search].present?
    @events = Event.near(params[:search], 50, :order => :distance)
  else
    @events = Event.all

SELECT events.*, (69.09332411348201 * ABS(events.latitude - 14.6760413) * 0.7071067811865475) + (59.836573914187355 * ABS(events.longitude - 121.0437003) * 0.7071067811865475) AS distance, CASE WHEN (latitude >= 14.6760413 AND longitude >= 121.0437003) THEN 45.0 WHEN (latitude < 14.6760413 AND longitude >= 121.0437003) THEN 135.0 WHEN (latitude < 14.6760413 AND longitude < 121.0437003) THEN 225.0 WHEN (latitude >= 14.6760413 AND longitude < 121.0437003) THEN 315.0 END AS bearing FROM "events" WHERE (latitude BETWEEN 14.531309516889152 AND 14.820773083110847 AND longitude BETWEEN 120.89408720708074 AND 121.19331339291925 AND events.id != 1) ORDER BY distance
---
  def show
    @event = Event.find(params[:id])

INSERT INTO "events" ("created_at", "details", "end", "img", "latitude", "longitude", "orgid", "start", "title", "type", "updated_at", "venue") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save